Show / Hide Table of Contents
Class SubStructureLoading
SubStructureLoading
Inheritance
System.Object
OpenObject
SubStructureLoading
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.SubStructureLoading, CI.StructuralElements", "CI.StructModel.Structure.ISubStructureLoading,CI.BasicTypes")]
public class SubStructureLoading : OpenObject
Constructors
Improve this Doc   View Source
SubStructureLoading()
Constructor
Declaration
public SubStructureLoading()
Properties
Improve this Doc   View Source
LoadCases
List of LoadCases
Declaration
public List<ReferenceElement> LoadCases { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
 Improve this Doc
 View Source